In [142]:
!pip install pyspark

Requirement already satisfied: pyspark in /usr/local/lib/python3.10/dist-packages (3.5.0)
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)

In [143]:
from pyspark.sql import SparkSession

spark= SparkSession.builder.appName("DF").getOrCreate()

# Create Empty RDD with sparkContext.emptyRDD()

In [ ]:

df = spark.sparkContext.emptyRDD()
df.collect()

[]

In [ ]:
#we can also create empty RDD with

emptyRDD = spark.sparkContext.parallelize([])
emptyRDD.collect()

[]

# Creating empty DF with req. schema

In [ ]:
# suppose we need empty df for name,salary,designation,age,

from pyspark.sql.types import *

schema = StructType().add('name',StringType(),False)\
                      .add('salary',FloatType(),False)\
                      .add('designation',StringType(),False)\
                      .add('age',IntegerType(),False)

df = spark.createDataFrame(data =emptyRDD ,schema=schema)
df.printSchema()
df.show()

root
 |-- name: string (nullable = false)
 |-- salary: float (nullable = false)
 |-- designation: string (nullable = false)
 |-- age: integer (nullable = false)

+----+------+-----------+---+
|name|salary|designation|age|
+----+------+-----------+---+
+----+------+-----------+---+

# Convert Empty RDD to empty_DF

In [ ]:
df1 = emptyRDD.toDF(schema)
df1.printSchema()
df1.show()

root
 |-- name: string (nullable = false)
 |-- salary: float (nullable = false)
 |-- designation: string (nullable = false)
 |-- age: integer (nullable = false)

+----+------+-----------+---+
|name|salary|designation|age|
+----+------+-----------+---+
+----+------+-----------+---+

In [ ]:
df2 = spark.createDataFrame([],schema)
df2.show(
)

+----+------+-----------+---+
|name|salary|designation|age|
+----+------+-----------+---+
+----+------+-----------+---+

we can convert rdd to DF as rdd.toDF()

we can convert DF to pandas Df as df.toPandas()

In [ ]:
df = spark.createDataFrame([(12,'shiva'),(23,'shankar')],schema='id integer,name string')
df.show()

+---+-------+
| id|   name|
+---+-------+
| 12|  shiva|
| 23|shankar|
+---+-------+

In [ ]:
pdf= df.toPandas()
print(pdf)

   id     name
0  12    shiva
1  23  shankar

## Column Functions:

COLUMN FUNCTION	FUNCTION DESCRIPTION

**alias(*alias, **kwargs) :** alias to the column or expressions

 **name(*alias, **kwargs):**	returns same as alias().

**asc()**:Returns ascending order of the column.

**asc_nulls_first():**Returns null values first then non-null values.

**asc_nulls_last() –** Returns null values after non-null values.

**astype(dataType)**Used to cast the data type to another type.

**cast(dataType)**	returns same as cast().

**between(lowerBound, upperBound)**	Checks if the columns values are between lower and upper bound. Returns boolean value.

**bitwiseAND(other)** Compute bitwise AND, OR & XOR of this expression with

**bitwiseOR(other) **   another expression respectively.

**bitwiseXOR(other)	**

**contains(other)**	Check if String contains in another string.

**desc()** Returns descending order of the column.

**desc_nulls_first()** -null values appear before non-null values.

**desc_nulls_last() –** null values appear after non-null values.

**startswith(other)**String starts with. Returns boolean expression

**endswith(other)	**String ends with. Returns boolean expression

**eqNullSafe(other)**	Equality test that is safe for null values.

**getField(name)**	Returns a field by name in a StructField and by key in Map.

**getItem(key)**	Returns a values from Map/Key at the provided position.

**isNotNull()**Returns True if the current expression is NOT null.

**isNull() –** Returns True if the current expression is null.

**isin(*cols)**A boolean expression that is evaluated to true if the value of this expression is contained by the evaluated values of the arguments.

**like(other)**Similar to SQL like expression.

**rlike(other)**	Similar to SQL RLIKE expression (LIKE with Regex)
.
**over(window)**	Used with window column

**substr(startPos, length)**	Return a Column which is a substring of the column.

**when(condition, value)
otherwise(value)** Similar to SQL CASE WHEN, Executes a list of conditions and returns one of multiple possible result expressions.

**dropFields(*fieldNames)**	Used to drops fields in StructType by name.

**withField(fieldName, col)**	An expression that adds/replaces a field in StructType by name.

In [3]:
#alias()

data=[("James","Bond","100",None),
      ("Ann","Varsa","200",'F'),
      ("Tom Cruise","XXX","400",''),
      ("Tom Brand",None,"400",'M')]
columns=["fname","lname","id","gender"]
df=spark.createDataFrame(data,columns)

df.select(df.fname.alias('first_name'),df.lname.alias('last_name')
   ).show()

+----------+---------+
|first_name|last_name|
+----------+---------+
|     James|     Bond|
|       Ann|    Varsa|
|Tom Cruise|      XXX|
| Tom Brand|     NULL|
+----------+---------+

In [4]:
from pyspark.sql.functions import col,asc

#Note: when do we use asc(), desc() ? while sorting !

data = [(100,'ram'),(23,'sham'),(1,'bheem'),(12,'krish')]
df = spark.createDataFrame(data,schema = 'id integer,name string')

df.sort(df.id.asc()).show(),df.sort(df.id.desc()).show()

+---+-----+
| id| name|
+---+-----+
|  1|bheem|
| 12|krish|
| 23| sham|
|100|  ram|
+---+-----+

+---+-----+
| id| name|
+---+-----+
|100|  ram|
| 23| sham|
| 12|krish|
|  1|bheem|
+---+-----+

(None, None)

In [5]:
from pyspark.sql.functions import *

**One of the simplest ways to create a Column class object is by using PySpark lit() SQL function, this takes a literal value and returns a Column object.**

In [8]:
colObj = lit('shiva')
print(colObj)

Column<'shiva'>

In [9]:
data=[("James",23),("Ann",40)]
df=spark.createDataFrame(data).toDF("name.fname","gender")
df.printSchema()

root
 |-- name.fname: string (nullable = true)
 |-- gender: long (nullable = true)

In [13]:
#Different ways of Accessing the df columns

# df.select(df.gender).show()
# df.select(col('gender')).show() # this using pysqpark.sql.functions col()
# df.select(df['gender']).show()

+------+
|gender|
+------+
|    23|
|    40|
+------+

In [21]:
data=[(100,2,1),(200,3,4),(300,4,4)]
df=spark.createDataFrame(data).toDF("col1","col2","col3")
# df.show()

#Arthmetic operations
# df.select(df.col1 + df.col2).show()
# df.select(df.col1 - df.col2).show()
# df.select(df.col1 * df.col2).show()
# df.select(df.col1 / df.col2).show()
# df.select(df.col1 % df.col2).show()

# Relational Operators
# df.select((df.col2 > df.col3).alias("Greater_than")).show()
# df.select((df.col2 < df.col3).alias('Less_than')).show()
# df.select((df.col2 == df.col3).alias("Equal")).show()

+----+----+----+
|col1|col2|col3|
+----+----+----+
| 100|   2|   1|
| 200|   3|   4|
| 300|   4|   4|
+----+----+----+

+-----+
|Equal|
+-----+
|false|
|false|
| true|
+-----+

# Select()

select is used to select columns of the DF.

**Select Single & Multiple Columns :**

df.select("firstname","lastname").show()

df.select(df.firstname,df.lastname).show()

df.select(df["firstname"],df["lastname"]).show()

#By using col() function

from pyspark.sql.functions import col

df.select(col("firstname"),col("lastname")).show()

**Selecting all columns**

df.select("*").show()

**Select Columns by Index**

df.select(df.columns[:3]).show(3)



**column functions that works along select are**

1.cast(dtype),astype(dtype)

2.alias(),name()

3.substr()

4.when() otherwise()

5.getField() & getItem()

In [34]:
dd = spark.read.csv('/content/driver-data (2).csv',header=True,inferSchema=True)

In [35]:
dd.show(12)

+----------+-------------+--------------------+
|        id|mean_dist_day|mean_over_speed_perc|
+----------+-------------+--------------------+
|3423311935|        71.24|                  28|
|3423313212|        52.53|                  25|
|3423313724|        64.54|                  27|
|3423311373|        55.69|                  22|
|3423310999|        54.58|                  25|
|3423313857|        41.91|                  10|
|3423312432|        58.64|                  20|
|3423311434|        52.02|                   8|
|3423311328|        31.25|                  34|
|3423312488|        44.31|                  19|
|3423311254|        49.35|                  40|
|3423312943|        58.07|                  45|
+----------+-------------+--------------------+
only showing top 12 rows

In [38]:
#converting mean_over_speed_perc to a floattype

dd_mean_over_speed = dd.select(dd.mean_over_speed_perc.cast('float'))
dd_mean_over_speed.show()

+--------------------+
|mean_over_speed_perc|
+--------------------+
|                28.0|
|                25.0|
|                27.0|
|                22.0|
|                25.0|
|                10.0|
|                20.0|
|                 8.0|
|                34.0|
|                19.0|
|                40.0|
|                45.0|
|                22.0|
|                19.0|
|                43.0|
|                32.0|
|                35.0|
|                27.0|
|                26.0|
|                30.0|
+--------------------+
only showing top 20 rows

In [43]:
# using alias

dd_mean_over_speed.select(dd_mean_over_speed.mean_over_speed_perc.alias("Mean_overSpeed")).show()

+--------------+
|Mean_overSpeed|
+--------------+
|          28.0|
|          25.0|
|          27.0|
|          22.0|
|          25.0|
|          10.0|
|          20.0|
|           8.0|
|          34.0|
|          19.0|
|          40.0|
|          45.0|
|          22.0|
|          19.0|
|          43.0|
|          32.0|
|          35.0|
|          27.0|
|          26.0|
|          30.0|
+--------------+
only showing top 20 rows

In [46]:
pd = spark.read.csv('/content/police.csv',header=True)

In [100]:
pd.show()

+----------+---------+-----------+-------------+--------------+----------+-----------+--------------------+---------+----------------+-----------+-------------+-----------+-------------+------------------+
| stop_date|stop_time|county_name|driver_gender|driver_age_raw|driver_age|driver_race|       violation_raw|violation|search_conducted|search_type| stop_outcome|is_arrested|stop_duration|drugs_related_stop|
+----------+---------+-----------+-------------+--------------+----------+-----------+--------------------+---------+----------------+-----------+-------------+-----------+-------------+------------------+
|2005-01-02|    01:55|       NULL|            M|        1985.0|      20.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-01-18|    08:15|       NULL|            M|        1965.0|      40.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-01-23|    23:15|       NULL|            M|        1972.0|      33.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-02-20|    17:15|       NULL|            M|        1986.0|      19.0|      White|    Call for Service|    Other|           False|       NULL|Arrest Driver|       True|    16-30 Min|             False|
|2005-03-14|    10:00|       NULL|            F|        1984.0|      21.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-03-23|    09:45|       NULL|            M|        1982.0|      23.0|      Black|Equipment/Inspect...|Equipment|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-04-01|    17:30|       NULL|            M|        1969.0|      36.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-06-06|    13:20|       NULL|            F|        1986.0|      19.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-13|    10:15|       NULL|            M|        1970.0|      35.0|      Black|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-13|    15:45|       NULL|            M|        1970.0|      35.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-13|    16:20|       NULL|            M|        1979.0|      26.0|      Asian|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-13|    19:00|       NULL|            F|        1966.0|      39.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-14|    19:55|       NULL|            M|        1979.0|      26.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-18|    19:30|       NULL|            F|        1984.0|      21.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-18|    19:45|       NULL|            M|        1969.0|      36.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-19|    00:30|       NULL|            M|        1982.0|      23.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-19|    00:30|       NULL|            M|        1982.0|      23.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-19|    23:30|       NULL|            M|        1979.0|      26.0|      White|Equipment/Inspect...|Equipment|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-20|    00:05|       NULL|            M|        1955.0|      50.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
|2005-07-24|    20:10|       NULL|            F|        1958.0|      47.0|      White|            Speeding| Speeding|           False|       NULL|     Citation|      False|     0-15 Min|             False|
+----------+---------+-----------+-------------+--------------+----------+-----------+--------------------+---------+----------------+-----------+-------------+-----------+-------------+------------------+
only showing top 20 rows

In [62]:
#substr
pd.select(pd.stop_outcome.substr(0,6)).show()

+-----------------------------+
|substring(stop_outcome, 0, 6)|
+-----------------------------+
|                       Citati|
|                       Citati|
|                       Citati|
|                       Arrest|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
|                       Citati|
+-----------------------------+
only showing top 20 rows

In [77]:
#when() and otherwise()
from pyspark.sql.functions import when

pd.select(pd.is_arrested,(when(pd.is_arrested == 'True',"Arrested!").otherwise("Not_Arrested :)")).alias('Result')).show(10)

+-----------+---------------+
|is_arrested|         Result|
+-----------+---------------+
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
|       True|      Arrested!|
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
|      False|Not_Arrested :)|
+-----------+---------------+
only showing top 10 rows

In [132]:
#getField() and getItem()

#Create DataFrame with struct, array & map
from pyspark.sql.types import StructType,StructField,StringType,ArrayType,MapType
data=[(("James","Bond"),["Java","C#"],{'hair':'black','eye':'brown'}),
      (("Ann","Varsa"),[".NET","Python"],{'hair':'brown','eye':'black'}),
      (("Tom Cruise",""),["Python","Scala"],{'hair':'red','eye':'grey'}),
      (("Tom Brand",None),["Perl","Ruby"],{'hair':'black','eye':'blue'})]

schema = StructType([
        StructField('name', StructType([
            StructField('fname', StringType(), True),
            StructField('lname', StringType(), True)])),
        StructField('languages', ArrayType(StringType()),True),
        StructField('properties', MapType(StringType(),StringType()),True)
     ])

# schema = StructType([
#     StructField('name',StructType([
#         StructField('fname',StringType()),
#         StructField('lname',StringType())
#     ]),
#     StructField("languages",ArrayType(StringType())),
#    StructField("properties",MapType(StringType(),StringType())))
# ])


df=spark.createDataFrame(data,schema)
df.printSchema()
df.show(truncate=False)

root
 |-- name: struct (nullable = true)
 |    |-- fname: string (nullable = true)
 |    |-- lname: string (nullable = true)
 |-- languages: array (nullable = true)
 |    |-- element: string (containsNull = true)
 |-- properties: map (nullable = true)
 |    |-- key: string
 |    |-- value: string (valueContainsNull = true)

+-----------------+---------------+-----------------------------+
|name             |languages      |properties                   |
+-----------------+---------------+-----------------------------+
|{James, Bond}    |[Java, C#]     |{eye -> brown, hair -> black}|
|{Ann, Varsa}     |[.NET, Python] |{eye -> black, hair -> brown}|
|{Tom Cruise, }   |[Python, Scala]|{eye -> grey, hair -> red}   |
|{Tom Brand, NULL}|[Perl, Ruby]   |{eye -> blue, hair -> black} |
+-----------------+---------------+-----------------------------+

In [84]:
#For mapTypes we use getFiled to access the elements
df.select(df.properties.getField('hair')).show()

+----------------+
|properties[hair]|
+----------------+
|           black|
|           brown|
|             red|
|           black|
+----------------+

In [88]:
#getItem() to get the elements with indexing or either by label.
#for arrayType,maType,nyType we can use this getItem(index OR label)

# df.select(df.properties.getItem('eye')).show()
df.select(df.languages.getItem(0
                               )).show()

+------------+
|languages[0]|
+------------+
|        Java|
|        .NET|
|      Python|
|        Perl|
+------------+

# Filter

Filter is just like where clause in SQL where we can apply some conditions.

cloumn functions that works along filter are

1.between(lowerBound, upperBound)

2.rlike(other) and like(other)

3.isin(*cols)

4.isNull() & isNotNull()

5.startswith(other) & endswith(other)

In [99]:
#between(lb,hb)

Ages21T45  = pd.select(pd.driver_age).filter(pd.driver_age.between(30,45).alias("AGE_b/w21&45"))

Ages21T45.sort(Ages21T45.driver_age.asc()).count()

9931

In [128]:
#contains

df = spark.createDataFrame([("Hello World","Hello Earth"),("Hii Anna","Hii MAMA"),("Hello Kushi","hi RAMj"),("Shiva","Shankar")],schema='col1 string,col2 string')
df.show()

+-----------+-----------+
|       col1|       col2|
+-----------+-----------+
|Hello World|Hello Earth|
|   Hii Anna|   Hii MAMA|
|Hello Kushi|    hi RAMj|
|      Shiva|    Shankar|
+-----------+-----------+

In [120]:

#conatins
df.select(df.col2).filter(df.col1.contains('hi')).show()

+-------+
|   col2|
+-------+
|hi RAMj|
+-------+

In [131]:
#startswith and endswith

df.select(df.col1).filter(df.col1.startswith("S")).show()

+-----+
| col1|
+-----+
|Shiva|
+-----+

# df.show()

# Default - displays 20 rows and
# 20 charactes from column value
df.show()

#Display full column contents
df.show(truncate=False)

# Display 2 rows and full column contents
df.show(2,truncate=False)

# Display 2 rows & column values 25 characters
df.show(2,truncate=25)

# Display DataFrame rows & columns vertically
df.show(n=3,truncate=25,vertical=True)

Syntax
def show(self, n=20, truncate=True, vertical=False)

# withcolumn()

withColumn() is a transformation function of DataFrame which is used to change the value, convert the datatype of an existing column, create a new column, and many more.

**Change column Dtype**

In [137]:
data = [('James','','Smith','1991-04-01','M',3000),
  ('Michael','Rose','','2000-05-19','M',4000),
  ('Robert','','Williams','1978-09-05','M',4000),
  ('Maria','Anne','Jones','1967-12-01','F',4000),
  ('Jen','Mary','Brown','1980-02-17','F',-1)]

columns = ["firstname","middlename","lastname","dob","gender","salary"]

df = spark.createDataFrame(data=data, schema = columns)
df.printSchema()

root
 |-- firstname: string (nullable = true)
 |-- middlename: string (nullable = true)
 |-- lastname: string (nullable = true)
 |-- dob: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

In [144]:
from pyspark.sql.functions import *
df.withColumn("salary",col('salary').cast('integer')).show()

+---------+----------+--------+----------+------+------+
|firstname|middlename|lastname|       dob|gender|salary|
+---------+----------+--------+----------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|
|  Michael|      Rose|        |2000-05-19|     M|  4000|
|   Robert|          |Williams|1978-09-05|     M|  4000|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|
+---------+----------+--------+----------+------+------+

**Create a Column from an Existing**

In [145]:
#creating a Bonus col with salary col

df.withColumn("Bonus",col("salary")+col("salary")*0.6).show()

+---------+----------+--------+----------+------+------+------+
|firstname|middlename|lastname|       dob|gender|salary| Bonus|
+---------+----------+--------+----------+------+------+------+
|    James|          |   Smith|1991-04-01|     M|  3000|4800.0|
|  Michael|      Rose|        |2000-05-19|     M|  4000|6400.0|
|   Robert|          |Williams|1978-09-05|     M|  4000|6400.0|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|6400.0|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|  -1.6|
+---------+----------+--------+----------+------+------+------+

**Add a New Column using withColumn()**

In [150]:
df  = df.withColumn("Designation",lit(when(col('salary')<=3000,"Staff").otherwise("Senior")))
df.show()

+---------+----------+--------+----------+------+------+-----------+
|firstname|middlename|lastname|       dob|gender|salary|Designation|
+---------+----------+--------+----------+------+------+-----------+
|    James|          |   Smith|1991-04-01|     M|  3000|      Staff|
|  Michael|      Rose|        |2000-05-19|     M|  4000|     Senior|
|   Robert|          |Williams|1978-09-05|     M|  4000|     Senior|
|    Maria|      Anne|   Jones|1967-12-01|     F|  4000|     Senior|
|      Jen|      Mary|   Brown|1980-02-17|     F|    -1|      Staff|
+---------+----------+--------+----------+------+------+-----------+

**Renaming the column with withColumnRenamed()**

In [152]:
df= df.withColumnRenamed("salary","PayScale")

df.show()

+---------+----------+--------+----------+------+--------+-----------+
|firstname|middlename|lastname|       dob|gender|PayScale|Designation|
+---------+----------+--------+----------+------+--------+-----------+
|    James|          |   Smith|1991-04-01|     M|    3000|      Staff|
|  Michael|      Rose|        |2000-05-19|     M|    4000|     Senior|
|   Robert|          |Williams|1978-09-05|     M|    4000|     Senior|
|    Maria|      Anne|   Jones|1967-12-01|     F|    4000|     Senior|
|      Jen|      Mary|   Brown|1980-02-17|     F|      -1|      Staff|
+---------+----------+--------+----------+------+--------+-----------+

# distinct()

**Get Distinct Rows (By Comparing All Columns)**

In [162]:
data = [("James", "Sales", 3000), \
    ("Michael", "Sales", 4600), \
    ("Robert", "Sales", 4100), \
    ("Maria", "Finance", 3000), \
    ("James", "Sales", 3000), \
    ("Scott", "Finance", 3300), \
    ("Jen", "Finance", 3900), \
    ("Jeff", "Marketing", 3000), \
    ("Kumar", "Marketing", 2000), \
    ("Saif", "Sales", 4100) \
  ]
columns= ["employee_name", "department", "salary"]
df = spark.createDataFrame(data,columns)
df.show()

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|        James|     Sales|  3000|
|      Michael|     Sales|  4600|
|       Robert|     Sales|  4100|
|        Maria|   Finance|  3000|
|        James|     Sales|  3000|
|        Scott|   Finance|  3300|
|          Jen|   Finance|  3900|
|         Jeff| Marketing|  3000|
|        Kumar| Marketing|  2000|
|         Saif|     Sales|  4100|
+-------------+----------+------+

In [158]:
df.count(),df.distinct().count()

(10, 9)

**dropduplicates([cols*])**--> return distinct records based on the unique col

In [163]:
df.dropDuplicates(["salary","department"]).show()

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|        Kumar| Marketing|  2000|
|        Maria|   Finance|  3000|
|         Jeff| Marketing|  3000|
|        James|     Sales|  3000|
|        Scott|   Finance|  3300|
|          Jen|   Finance|  3900|
|       Robert|     Sales|  4100|
|      Michael|     Sales|  4600|
+-------------+----------+------+

# Sort() / orderBy()


PySpark DataFrame class provides sort() function to sort on one or more columns. By default, it sorts by ascending order.

In [166]:
# df.sort(col('salary').desc()).show()

df.orderBy(col('salary').desc()).show()

+-------------+----------+------+
|employee_name|department|salary|
+-------------+----------+------+
|      Michael|     Sales|  4600|
|         Saif|     Sales|  4100|
|       Robert|     Sales|  4100|
|          Jen|   Finance|  3900|
|        Scott|   Finance|  3300|
|        James|     Sales|  3000|
|         Jeff| Marketing|  3000|
|        Maria|   Finance|  3000|
|        James|     Sales|  3000|
|        Kumar| Marketing|  2000|
+-------------+----------+------+

# groupBy()

When we perform groupBy() on PySpark Dataframe, it returns GroupedData object which contains below aggregate functions.

count() - Use groupBy() count() to return the number of rows for each group.

mean() - Returns the mean of values for each group.

max() - Returns the maximum of values for each group.

min() - Returns the minimum of values for each group.

sum() - Returns the total for values for each group.

avg() - Returns the average for values for each group.

agg() - Using groupBy() agg() function, we can calculate more than one aggregate at a time.

pivot() - This function is used to Pivot the DataFrame.

In [169]:
df.groupBy("department").count().show()

+----------+-----+
|department|count|
+----------+-----+
|     Sales|    5|
|   Finance|    3|
| Marketing|    2|
+----------+-----+

In [170]:
simpleData = [("James","Sales","NY",90000,34,10000),
    ("Michael","Sales","NY",86000,56,20000),
    ("Robert","Sales","CA",81000,30,23000),
    ("Maria","Finance","CA",90000,24,23000),
    ("Raman","Finance","CA",99000,40,24000),
    ("Scott","Finance","NY",83000,36,19000),
    ("Jen","Finance","NY",79000,53,15000),
    ("Jeff","Marketing","CA",80000,25,18000),
    ("Kumar","Marketing","NY",91000,50,21000)
  ]

schema = ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data=simpleData, schema = schema)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Raman        |Finance   |CA   |99000 |40 |24000|
|Scott        |Finance   |NY   |83000 |36 |19000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

In [178]:
#find min,max,mean,sum of salary for the group of department

df.groupBy('department').min("salary").show(),
df.groupBy('department').max("salary").show(),
df.groupBy('department').sum("salary").show()

+----------+-----------+
|department|min(salary)|
+----------+-----------+
|     Sales|      81000|
|   Finance|      79000|
| Marketing|      80000|
+----------+-----------+

+----------+-----------+
|department|max(salary)|
+----------+-----------+
|     Sales|      90000|
|   Finance|      99000|
| Marketing|      91000|
+----------+-----------+

+----------+-----------+
|department|sum(salary)|
+----------+-----------+
|     Sales|     257000|
|   Finance|     351000|
| Marketing|     171000|
+----------+-----------+

In [179]:
#using multiple columns

df.groupBy("department","state").sum("salary","bonus").show()

+----------+-----+-----------+----------+
|department|state|sum(salary)|sum(bonus)|
+----------+-----+-----------+----------+
|     Sales|   CA|      81000|     23000|
|   Finance|   CA|     189000|     47000|
|     Sales|   NY|     176000|     30000|
|   Finance|   NY|     162000|     34000|
| Marketing|   NY|      91000|     21000|
| Marketing|   CA|      80000|     18000|
+----------+-----+-----------+----------+

In [180]:
#groupBy using agg()


df.groupBy("department") \
    .agg(sum("salary").alias("sum_salary"), \
         avg("salary").alias("avg_salary"), \
         sum("bonus").alias("sum_bonus"), \
         max("bonus").alias("max_bonus") \
     ) \
    .show(truncate=False)

+----------+----------+-----------------+---------+---------+
|department|sum_salary|avg_salary       |sum_bonus|max_bonus|
+----------+----------+-----------------+---------+---------+
|Sales     |257000    |85666.66666666667|53000    |23000    |
|Finance   |351000    |87750.0          |81000    |24000    |
|Marketing |171000    |85500.0          |39000    |21000    |
+----------+----------+-----------------+---------+---------+

In [181]:
#groupBy() with filter()

df.groupBy("department") \
    .agg(sum("salary").alias("sum_salary"), \
      avg("salary").alias("avg_salary"), \
      sum("bonus").alias("sum_bonus"), \
      max("bonus").alias("max_bonus")) \
    .where(col("sum_bonus") >= 50000) \
    .show(truncate=False)

+----------+----------+-----------------+---------+---------+
|department|sum_salary|avg_salary       |sum_bonus|max_bonus|
+----------+----------+-----------------+---------+---------+
|Sales     |257000    |85666.66666666667|53000    |23000    |
|Finance   |351000    |87750.0          |81000    |24000    |
+----------+----------+-----------------+---------+---------+

# join()

join(self, other, on=None, how=None)

join() operation takes parameters as below and returns DataFrame.

param other: Right side of the join

param on: a string for the join column name

param how: default inner. Must be one of inner, cross, outer,full, full_outer, left, left_outer, right, right_outer,left_semi, and left_anti.

In [182]:
#Dataset

emp = [(1,"Smith",1,"2018","10","M",3000), \
    (2,"Rose",1,"2010","20","M",4000), \
    (3,"Williams",1,"2010","10","M",1000), \
    (4,"Jones",2,"2005","10","F",2000), \
    (5,"Brown",2,"2010","40","",-1), \
      (6,"Brown",2,"2010","50","",-1) \
  ]
empColumns = ["emp_id","name","superior_emp_id","year_joined", \
       "emp_dept_id","gender","salary"]

empDF = spark.createDataFrame(data=emp, schema = empColumns)
empDF.printSchema()
empDF.show(truncate=False)

dept = [("Finance",10), \
    ("Marketing",20), \
    ("Sales",30), \
    ("IT",40) \
  ]
deptColumns = ["dept_name","dept_id"]
deptDF = spark.createDataFrame(data=dept, schema = deptColumns)
deptDF.printSchema()
deptDF.show(truncate=False)

root
 |-- emp_id: long (nullable = true)
 |-- name: string (nullable = true)
 |-- superior_emp_id: long (nullable = true)
 |-- year_joined: string (nullable = true)
 |-- emp_dept_id: string (nullable = true)
 |-- gender: string (nullable = true)
 |-- salary: long (nullable = true)

+------+--------+---------------+-----------+-----------+------+------+
|emp_id|name    |superior_emp_id|year_joined|emp_dept_id|gender|salary|
+------+--------+---------------+-----------+-----------+------+------+
|1     |Smith   |1              |2018       |10         |M     |3000  |
|2     |Rose    |1              |2010       |20         |M     |4000  |
|3     |Williams|1              |2010       |10         |M     |1000  |
|4     |Jones   |2              |2005       |10         |F     |2000  |
|5     |Brown   |2              |2010       |40         |      |-1    |
|6     |Brown   |2              |2010       |50         |      |-1    |
+------+--------+---------------+-----------+-----------+------+------+

root
 |-- dept_name: string (nullable = true)
 |-- dept_id: long (nullable = true)

+---------+-------+
|dept_name|dept_id|
+---------+-------+
|Finance  |10     |
|Marketing|20     |
|Sales    |30     |
|IT       |40     |
+---------+-------+

**Inner Join**

In [186]:
empDF.join(deptDF,empDF.emp_dept_id == deptDF.dept_id,"inner").show()

#Inner join is the default join in PySpark and it's mostly used.
# This joins two datasets on key columns, where keys don't match the rows get dropped from both datasets (emp & dept).

# When we apply Inner join on our datasets,
# It drops "emp_dept_id" 50 from "emp" and "dept_id" 30 from "dept" datasets.
# Below is the result of the above Join expression.

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|              1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Outer Join**

In [187]:
  # Outer a.k.a full, fullouter join returns all rows from both datasets,
  # where join expression doesn't match it returns null on respective record columns.

  # From our "emp" dataset's "emp_dept_id" with value 50 doesn't have a record on "dept"
  # hence dept columns have null and "dept_id" 30 doesn't have a record in "emp" hence you see null's on emp columns.
  # Below is the result of the above Join expression.

  empDF.join(deptDF,empDF.emp_dept_id == deptDF.dept_id,"outer").show()

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|    name|superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|     1|   Smith|              1|       2018|         10|     M|  3000|  Finance|     10|
|     3|Williams|              1|       2010|         10|     M|  1000|  Finance|     10|
|     4|   Jones|              2|       2005|         10|     F|  2000|  Finance|     10|
|     2|    Rose|              1|       2010|         20|     M|  4000|Marketing|     20|
|  NULL|    NULL|           NULL|       NULL|       NULL|  NULL|  NULL|    Sales|     30|
|     5|   Brown|              2|       2010|         40|      |    -1|       IT|     40|
|     6|   Brown|              2|       2010|         50|      |    -1|     NULL|   NULL|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Left Join**

Left a.k.a Leftouter join returns all rows from the left dataset regardless of match found on the right dataset when join expression doesn't match, it assigns null for that record and drops records from right where match not found.

From our dataset, "emp_dept_id" 5o doesn't have a record on "dept" dataset hence, this record contains null on "dept" columns (dept_name & dept_id). and "dept_id" 30 from "dept" dataset dropped from the results. Below is the result of the above Join expression.

In [189]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"left").show(truncate=False)
  # empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"leftouter")
  #   .show(truncate=False)

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|name    |superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|1     |Smith   |1              |2018       |10         |M     |3000  |Finance  |10     |
|3     |Williams|1              |2010       |10         |M     |1000  |Finance  |10     |
|2     |Rose    |1              |2010       |20         |M     |4000  |Marketing|20     |
|6     |Brown   |2              |2010       |50         |      |-1    |NULL     |NULL   |
|4     |Jones   |2              |2005       |10         |F     |2000  |Finance  |10     |
|5     |Brown   |2              |2010       |40         |      |-1    |IT       |40     |
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Right Join**

Right a.k.a Rightouter join is opposite of left join, here it returns all rows from the right dataset regardless of math found on the left dataset, when join expression doesn't match, it assigns null for that record and drops records from left where match not found.

From our example, the right dataset "dept_id" 30 doesn't have it on the left dataset "emp" hence, this record contains null on "emp" columns. and "emp_dept_id" 50 dropped as a match not found on left. Below is the result of the above Join expression.

In [190]:
empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"right") \
   .show(truncate=False)
# empDF.join(deptDF,empDF.emp_dept_id ==  deptDF.dept_id,"rightouter") \
#    .show(truncate=False)

+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|emp_id|name    |superior_emp_id|year_joined|emp_dept_id|gender|salary|dept_name|dept_id|
+------+--------+---------------+-----------+-----------+------+------+---------+-------+
|4     |Jones   |2              |2005       |10         |F     |2000  |Finance  |10     |
|3     |Williams|1              |2010       |10         |M     |1000  |Finance  |10     |
|1     |Smith   |1              |2018       |10         |M     |3000  |Finance  |10     |
|2     |Rose    |1              |2010       |20         |M     |4000  |Marketing|20     |
|NULL  |NULL    |NULL           |NULL       |NULL       |NULL  |NULL  |Sales    |30     |
|5     |Brown   |2              |2010       |40         |      |-1    |IT       |40     |
+------+--------+---------------+-----------+-----------+------+------+---------+-------+

**Left semijoin**
l
leftsemi join is similar to inner join difference being leftsemi join returns all columns from the left dataset and ignores all columns from the right dataset. In other words, this join returns columns from the only left dataset for the records match in the right dataset on join expression, records not matched on join expression are ignored from both left and right datasets.

The same result can be achieved using select on the result of the inner join however, using this join would be efficient.

**Left Anti**

leftanti join does the exact opposite of the leftsemi, leftanti join returns only columns from the left dataset for non-matched records.

# Union() and UnionAll()

Dataframe union() - union() method of the DataFrame is used to merge two DataFrame's of the same structure/schema. If schemas are not the same it returns an error.

DataFrame unionAll() - unionAll() is deprecated since Spark "2.0.0" version and replaced with union().

In [191]:
# Data


simpleData = [("James","Sales","NY",90000,34,10000), \
    ("Michael","Sales","NY",86000,56,20000), \
    ("Robert","Sales","CA",81000,30,23000), \
    ("Maria","Finance","CA",90000,24,23000) \
  ]

columns= ["employee_name","department","state","salary","age","bonus"]
df = spark.createDataFrame(data = simpleData, schema = columns)
df.printSchema()
df.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Michael      |Sales     |NY   |86000 |56 |20000|
|Robert       |Sales     |CA   |81000 |30 |23000|
|Maria        |Finance   |CA   |90000 |24 |23000|
+-------------+----------+-----+------+---+-----+

In [192]:
simpleData2 = [("James","Sales","NY",90000,34,10000), \
    ("Maria","Finance","CA",90000,24,23000), \
    ("Jen","Finance","NY",79000,53,15000), \
    ("Jeff","Marketing","CA",80000,25,18000), \
    ("Kumar","Marketing","NY",91000,50,21000) \
  ]
columns2= ["employee_name","department","state","salary","age","bonus"]

df2 = spark.createDataFrame(data = simpleData2, schema = columns2)

df2.printSchema()
df2.show(truncate=False)

root
 |-- employee_name: string (nullable = true)
 |-- department: string (nullable = true)
 |-- state: string (nullable = true)
 |-- salary: long (nullable = true)
 |-- age: long (nullable = true)
 |-- bonus: long (nullable = true)

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|James        |Sales     |NY   |90000 |34 |10000|
|Maria        |Finance   |CA   |90000 |24 |23000|
|Jen          |Finance   |NY   |79000 |53 |15000|
|Jeff         |Marketing |CA   |80000 |25 |18000|
|Kumar        |Marketing |NY   |91000 |50 |21000|
+-------------+----------+-----+------+---+-----+

In [193]:
#both union and unionall returns the same.

df.unionAll(df2).show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|        James|     Sales|   NY| 90000| 34|10000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
+-------------+----------+-----+------+---+-----+

In [194]:
#union without duplicates

df.union(df2).distinct().show()

+-------------+----------+-----+------+---+-----+
|employee_name|department|state|salary|age|bonus|
+-------------+----------+-----+------+---+-----+
|        James|     Sales|   NY| 90000| 34|10000|
|      Michael|     Sales|   NY| 86000| 56|20000|
|        Maria|   Finance|   CA| 90000| 24|23000|
|       Robert|     Sales|   CA| 81000| 30|23000|
|        Kumar| Marketing|   NY| 91000| 50|21000|
|          Jen|   Finance|   NY| 79000| 53|15000|
|         Jeff| Marketing|   CA| 80000| 25|18000|
+-------------+----------+-----+------+---+-----+

# unionByName()

The difference between unionByName() function and union() is that this function
resolves columns by name (not by position). In other words, unionByName() is used to merge two DataFrames by column names instead of by position.

unionByName() also provides an argument allowMissingColumns to specify if you have a different column counts. In case you are using an older than Spark 3.1 version, use the below approach to merge DataFrames with different column names.

In [195]:
# Create DataFrame df1 with columns name, and id
data = [("James",34), ("Michael",56), \
        ("Robert",30), ("Maria",24) ]

df1 = spark.createDataFrame(data = data, schema=["name","id"])
df1.printSchema()

# Create DataFrame df2 with columns name and id
data2=[(34,"James"),(45,"Maria"), \
       (45,"Jen"),(34,"Jeff")]

df2 = spark.createDataFrame(data = data2, schema = ["id","name"])
df2.printSchema()

root
 |-- name: string (nullable = true)
 |-- id: long (nullable = true)

root
 |-- id: long (nullable = true)
 |-- name: string (nullable = true)

In [197]:
df1.unionByName(df2,allowMissingColumns=True).show()

+-------+---+
|   name| id|
+-------+---+
|  James| 34|
|Michael| 56|
| Robert| 30|
|  Maria| 24|
|  James| 34|
|  Maria| 45|
|    Jen| 45|
|   Jeff| 34|
+-------+---+

In [198]:
#unionByName with different col names

df1 = spark.createDataFrame([[5, 2, 6]], ["col0", "col1", "col2"])
df2 = spark.createDataFrame([[6, 7, 3]], ["col1", "col2", "col3"])

df1.unionByName(df2,allowMissingColumns=True).show()

+----+----+----+----+
|col0|col1|col2|col3|
+----+----+----+----+
|   5|   2|   6|NULL|
|NULL|   6|   7|   3|
+----+----+----+----+